Revit 2027 API
BalusterPattern.BreakPattern Property
 The condition which controls breaking baluster patterns distribution.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BreakPatternCondition BreakPattern { get; set; }
Public Property BreakPattern As BreakPatternCondition
	Get
	Set
public:
property BreakPatternCondition BreakPattern {
	BreakPatternCondition get ();
	void set (BreakPatternCondition value);
}
member BreakPattern : BreakPatternCondition with get, set
Property Value
BreakPatternCondition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace